brain/Ouyang2020.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-03-19 ven. 15:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Ouyang2020: Projecting onto intersections of halfspaces and hyperplanes</title>
<meta name="author" content="Rafael Accácio Nogueira" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content">
<h1 class="title">Ouyang2020: Projecting onto intersections of halfspaces and hyperplanes</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ol>
<li><a href="#Ouyang2020">1. Projecting onto intersections of halfspaces and hyperplanes</a>
<ol>
<li><a href="#org17d964f">1.1. CATALOG</a>
<ol>
<li><a href="#org7df1eb2">1.1.1. Motivation&#xa0;&#xa0;&#xa0;<span class="tag"><span class="springGreen">springGreen</span></span></a></li>
<li><a href="#org7f5fcf9">1.1.2. Model&#xa0;&#xa0;&#xa0;<span class="tag"><span class="lightSkyblue">lightSkyblue</span></span></a></li>
<li><a href="#org3312d9a">1.1.3. Remarks</a></li>
<li><a href="#org048d52e">1.1.4. Applications</a></li>
<li><a href="#org73d4391">1.1.5. Expressions</a></li>
<li><a href="#org1731236">1.1.6. References&#xa0;&#xa0;&#xa0;<span class="tag"><span class="violet">violet</span></span></a></li>
</ol>
</li>
<li><a href="#orgc0bebf5">1.2. NOTES</a>
<ol>
<li><a href="#org0e9eedd">1.2.1. Notation for hyperplane</a></li>
<li><a href="#orgb2b7f41">1.2.2. expression</a></li>
<li><a href="#orgdb5f957">1.2.3. projection onto intersection of hyperplanes</a></li>
<li><a href="#orgfd06c94">1.2.4. normals are divided into two groups</a></li>
<li><a href="#org11bf56b">1.2.5. Each \(u_i\) is a linear combination of the first \(t\) elements</a></li>
<li><a href="#orgf617ed0">1.2.6. ignore LD hyperplanes</a></li>
<li><a href="#org742a2ae">1.2.7. the LD components do not interfere</a></li>
<li><a href="#orgd02f9a8">1.2.8. mesmo resultado que obtive</a></li>
<li><a href="#orgfd88ead">1.2.9. Projection algorithm</a></li>
<li><a href="#org8722864">1.2.10. for LD halfspaces if \(W_1\cap W_2\neq\emptyset\) then \(P_{W_2}P_{W_1}=P_{W_1\cap W_2}\)</a></li>
<li><a href="#org61ba6dd">1.2.11. not necessarily \(P_{W_2}P_{W_1}=P_{W_1\cap W_2}\)</a></li>
<li><a href="#orgd422e6e">1.2.12. general relation</a></li>
<li><a href="#org710f80f">1.2.13. if LI and orthogonal then \(P_{W_2}P_{W_1}=P_{W_1\cap W_2}\)</a></li>
</ol>
</li>
</ol>
</li>
</ol>
</div>
</div>
<dl class="org-dl">
<dt>tags</dt><dd><a href=20200429185809-linear_algebra.html>Linear Algebra</a>, <a href=20201215140935-projection.html>projection</a></dd>
<dt>keywords</dt><dd></dd>
</dl>


<div id="outline-container-Ouyang2020" class="outline-2">
<h2 id="Ouyang2020"><span class="section-number-2">1</span> Projecting onto intersections of halfspaces and hyperplanes</h2>
<div class="outline-text-2" id="text-Ouyang2020">
</div>

<div id="outline-container-org17d964f" class="outline-3">
<h3 id="org17d964f"><span class="section-number-3">1.1</span> CATALOG</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org7df1eb2" class="outline-4">
<h4 id="org7df1eb2"><span class="section-number-4">1.1.1</span> Motivation&#xa0;&#xa0;&#xa0;<span class="tag"><span class="springGreen">springGreen</span></span></h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Projection onto intersections of halfspaces and hyperplanes
</p>
</div>
</div>
<div id="outline-container-org7f5fcf9" class="outline-4">
<h4 id="org7f5fcf9"><span class="section-number-4">1.1.2</span> Model&#xa0;&#xa0;&#xa0;<span class="tag"><span class="lightSkyblue">lightSkyblue</span></span></h4>
</div>
<div id="outline-container-org3312d9a" class="outline-4">
<h4 id="org3312d9a"><span class="section-number-4">1.1.3</span> Remarks</h4>
</div>
<div id="outline-container-org048d52e" class="outline-4">
<h4 id="org048d52e"><span class="section-number-4">1.1.4</span> Applications</h4>
</div>
<div id="outline-container-org73d4391" class="outline-4">
<h4 id="org73d4391"><span class="section-number-4">1.1.5</span> Expressions</h4>
</div>
<div id="outline-container-org1731236" class="outline-4">
<h4 id="org1731236"><span class="section-number-4">1.1.6</span> References&#xa0;&#xa0;&#xa0;<span class="tag"><span class="violet">violet</span></span></h4>
</div>
</div>

<div id="outline-container-orgc0bebf5" class="outline-3">
<h3 id="orgc0bebf5"><span class="section-number-3">1.2</span> NOTES</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org0e9eedd" class="outline-4">
<h4 id="org0e9eedd"><span class="section-number-4">1.2.1</span> Notation for hyperplane</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
\(H_i\triangleq \{ x \in\mathcal{H}:\langle x,u_i \rangle=\eta_i \}\)
</p>
</div>
</div>

<div id="outline-container-orgb2b7f41" class="outline-4">
<h4 id="orgb2b7f41"><span class="section-number-4">1.2.2</span> expression</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
\(\gamma\triangleq {|\langle u_1,u_2\rangle| \over \|u_1\|\|u_2\|}\in [0,1[\)
</p>
</div>
</div>

<div id="outline-container-orgdb5f957" class="outline-4">
<h4 id="orgdb5f957"><span class="section-number-4">1.2.3</span> projection onto intersection of hyperplanes</h4>
<div class="outline-text-4" id="text-1-2-3">
</div>
</div>

<div id="outline-container-orgfd06c94" class="outline-4">
<h4 id="orgfd06c94"><span class="section-number-4">1.2.4</span> normals are divided into two groups</h4>
<div class="outline-text-4" id="text-1-2-4">
<ol class="org-ol">
<li>LI</li>
<li>LD</li>
</ol>
</div>
</div>

<div id="outline-container-org11bf56b" class="outline-4">
<h4 id="org11bf56b"><span class="section-number-4">1.2.5</span> Each \(u_i\) is a linear combination of the first \(t\) elements</h4>
<div class="outline-text-4" id="text-1-2-5">
</div>
</div>

<div id="outline-container-orgf617ed0" class="outline-4">
<h4 id="orgf617ed0"><span class="section-number-4">1.2.6</span> ignore LD hyperplanes</h4>
<div class="outline-text-4" id="text-1-2-6">
<p>
if new hyperplane does not provide any new information we can neglect it
</p>
</div>
</div>

<div id="outline-container-org742a2ae" class="outline-4">
<h4 id="org742a2ae"><span class="section-number-4">1.2.7</span> the LD components do not interfere</h4>
<div class="outline-text-4" id="text-1-2-7">
</div>
</div>


<div id="outline-container-orgd02f9a8" class="outline-4">
<h4 id="orgd02f9a8"><span class="section-number-4">1.2.8</span> mesmo resultado que obtive</h4>
<div class="outline-text-4" id="text-1-2-8">
</div>
</div>


<div id="outline-container-orgfd88ead" class="outline-4">
<h4 id="orgfd88ead"><span class="section-number-4">1.2.9</span> Projection algorithm</h4>
<div class="outline-text-4" id="text-1-2-9">
<p>
<a class='org-ref-reference' href="#BoyleDykstra1986">BoyleDykstra1986</a>
</p>
</div>
</div>

<div id="outline-container-org8722864" class="outline-4">
<h4 id="org8722864"><span class="section-number-4">1.2.10</span> for LD halfspaces if \(W_1\cap W_2\neq\emptyset\) then \(P_{W_2}P_{W_1}=P_{W_1\cap W_2}\)</h4>
<div class="outline-text-4" id="text-1-2-10">
</div>
</div>

<div id="outline-container-org61ba6dd" class="outline-4">
<h4 id="org61ba6dd"><span class="section-number-4">1.2.11</span> not necessarily \(P_{W_2}P_{W_1}=P_{W_1\cap W_2}\)</h4>
<div class="outline-text-4" id="text-1-2-11">
<p>
there is a distance between the values if normals inner product is positive
</p>
</div>
</div>

<div id="outline-container-orgd422e6e" class="outline-4">
<h4 id="orgd422e6e"><span class="section-number-4">1.2.12</span> general relation</h4>
<div class="outline-text-4" id="text-1-2-12">
</div>
</div>

<div id="outline-container-org710f80f" class="outline-4">
<h4 id="org710f80f"><span class="section-number-4">1.2.13</span> if LI and orthogonal then \(P_{W_2}P_{W_1}=P_{W_1\cap W_2}\)</h4>
<div class="outline-text-4" id="text-1-2-13">
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Rafael Accácio Nogueira</p>
<p class="date">Created: 2021-03-19 ven. 15:39</p>
</div>
</body>
</html>
